### [ 데이터 필터링 ] 
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터를 걸러낸다.
- 다양한 조건 검사 진행. => 비교검사 : 같다 ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다<=

(1) 모듈로딩<hr>

In [165]:
import pandas as pd

In [166]:
import numpy as np

(2) 데이터 준비 <hr>

In [167]:
file = '../DATA/employees.csv'

(3) 데이터 저장 <hr>

In [168]:
empDF = pd.read_csv(file)

(4) 데이터 확인 <hr>

In [169]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

(5) 데이터 다루기

In [170]:
'Happy' == 'Happy', 'Happy' == 'happy'

(True, False)

- [문제] 데이터에서 이름이 Maria인 데이터만 추출.

In [171]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

- bool 값으로 구성된 데이터 ==> 불린 인덱싱(Boolean Indexing)

In [172]:
mariaMask = (empDF['First Name'] == 'Maria')
type(mariaMask) #type Series

pandas.core.series.Series

In [173]:
mariaMask.sum()
(empDF['First Name'] == 'Maria').sum() #마리아를 first name 값으로 쓰는 행의 개수

6

In [174]:
#empDF = pd.read_csv(file, index_col = 'First Name')

In [175]:
empDF[empDF['First Name'] == 'Maria']
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [176]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

-[문제] employee 데이터에서 연봉이 14만 이상인 데이터 추출

In [177]:
salary = (empDF['Salary'] >=140000)

In [178]:
empDF[salary]

    First Name  Gender Start Date    Salary   Mgmt          Team
36      Rachel  Female    2/16/09  142032.0  False  Business Dev
44     Cynthia  Female   11/16/88  145146.0   True       Product
83       Shawn    Male    9/23/05  148115.0   True       Finance
87       Annie  Female    1/30/93  144887.0   True         Sales
96     Cynthia  Female    3/21/94  142321.0  False       Finance
..         ...     ...        ...       ...    ...           ...
948     Ashley  Female    3/31/06  142410.0   True   Engineering
951        NaN  Female    9/14/10  143638.0    NaN           NaN
979     Ernest    Male    7/20/13  142935.0   True       Product
981      James    Male    1/15/93  148985.0  False         Legal
983       John    Male   12/23/82  146907.0  False   Engineering

[80 rows x 6 columns]

-[문제] employee 데이터에서 성별이 남자이고 연봉이 10만 이상인 데이터 추출

In [179]:
mask = (empDF['Gender'] == 'Male') & (empDF['Salary'] >= 100000)

In [180]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male    1/24/98  101004.0   True           IT
5       Dennis   Male    4/18/87  115163.0  False        Legal
12     Brandon   Male    12/1/80  112807.0   True           HR
13        Gary   Male    1/27/08  109831.0  False        Sales
17       Shawn   Male    12/7/86  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male    7/20/13  142935.0   True      Product
981      James   Male    1/15/93  148985.0  False        Legal
983       John   Male   12/23/82  146907.0  False  Engineering
992    Anthony   Male   10/16/11  112769.0   True      Finance
999     Albert   Male    5/15/12  129949.0   True        Sales

[176 rows x 6 columns]

- 여러 개의 조건이 모두 True 여야만 하는 조건. => AND 조건 &
    * 문법 : 조건 1 & 조건 2 & 조건 3 &... 조건 n
    * 연산자 : & 엔퍼센트

In [181]:
#타이타닉 생존자의 성별 및 연령대, 등석 등의 관계

- 여러 개의 조건이 1개 이상이 True면 True가 되는 조건. => OR 조건 |
    * 문법 : 조건 1 | 조건 2 | 조건 3 |... 조건 n
    * 연산자 : | 파이프
    * 결과값 : True / False

-[문제] employee 데이터에서 입사일이 1993년 1월 1일 이전 이거나 또는 팀(매니지먼트)이 없는 사람 조회.

In [182]:
empDF['Start Date'] = pd.to_datetime(empDF['Start Date'])

C:\Users\KDP-024\AppData\Local\Temp\ipykernel_2744\1557590731.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF['Start Date'] = pd.to_datetime(empDF['Start Date'])

In [183]:
mask2 = (empDF['Mgmt'] == False) | (empDF['Start Date']>'1993-01-01')
empDF[mask2]

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[832 rows x 6 columns]

In [184]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN    NaN           NaN

[1001 rows x 6 columns]

In [185]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [186]:
'a' in ['a', 'b', 'c']

True

In [187]:
('a' == 'a') | ('a' == 'b')|('a'=='c')

True

In [188]:
(empDF['Team'] == 'Sales') | (empDF['Team'] == 'legal') | (empDF['Team'] == 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [189]:
empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불린 메서드 => DF.between(low, high)

In [190]:
(empDF['Salary']>= 80000) & (empDF['Salary'] < 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [192]:
empDF['Salary'].between(80000, 90000) #between는 기본적으로 low값과 high값을 모두 포함한다.

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [193]:
empDF['Salary'].between(80000, 90000, inclusive='neither')

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [194]:
empDF['First Name'].str.upper()

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [195]:
empDF['First Name'].str.lower()

0       douglas
1        thomas
2         maria
3         jerry
4         larry
         ...
996     phillip
997     russell
998       larry
999      albert
1000        NaN
Name: First Name, Length: 1001, dtype: object

In [196]:
empDF['First Name'].str.replace('maria', 'Maria')

0       Douglas
1        Thomas
2         Maria
3         Jerry
4         Larry
         ...
996     Phillip
997     Russell
998       Larry
999      Albert
1000        NaN
Name: First Name, Length: 1001, dtype: object